; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-22)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(free left)
(free right)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 22
2. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 9 of 22
3. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 9 of 22
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 22
5. (drop ball4 rooma right)
   deleted: (carry ball4 right)
   added: (at ball4 rooma) (free right)
   goals met: 10 of 22
6. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 11 of 22
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 22
8. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 11 of 22
9. (pick ball2 roomb right)
   deleted: (at ball2 roomb) (free right)
   added: (carry ball2 right)
   goals met: 11 of 22
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 22
11. (drop ball2 rooma right)
   deleted: (carry ball2 right)
   added: (at ball2 rooma) (free right)
   goals met: 12 of 22
12. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 13 of 22
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 22
14. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 13 of 22
15. (pick ball21 room5 left)
   deleted: (at ball21 room5) (free left)
   added: (carry ball21 left)
   goals met: 13 of 22
16. (pick ball20 room5 right)
   deleted: (at ball20 room5) (free right)
   added: (carry ball20 right)
   goals met: 13 of 22
17. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 13 of 22
18. (drop ball20 room4 right)
   deleted: (carry ball20 right)
   added: (at ball20 room4) (free right)
   goals met: 14 of 22
19. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 15 of 22
20. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 15 of 22
21. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 15 of 22
22. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 16 of 22
23. (pick ball9 room3 right)
   deleted: (at ball9 room3) (free right)
   added: (carry ball9 right)
   goals met: 16 of 22
24. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 22
25. (drop ball9 roomb right)
   deleted: (carry ball9 right)
   added: (at ball9 roomb) (free right)
   goals met: 17 of 22
26. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 17 of 22
27. (pick ball19 room5 left)
   deleted: (at ball19 room5) (free left)
   added: (carry ball19 left)
   goals met: 17 of 22
28. (pick ball18 room5 right)
   deleted: (at ball18 room5) (free right)
   added: (carry ball18 right)
   goals met: 17 of 22
29. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 17 of 22
30. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 17 of 22
31. (drop ball18 room4 right)
   deleted: (carry ball18 right)
   added: (at ball18 room4) (free right)
   goals met: 18 of 22
32. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 19 of 22
33. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 19 of 22
34. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 19 of 22
35. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 19 of 22
36. (pick ball7 room3 right)
   deleted: (at ball7 room3) (free right)
   added: (carry ball7 right)
   goals met: 19 of 22
37. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 19 of 22
38. (drop ball7 roomb right)
   deleted: (carry ball7 right)
   added: (at ball7 roomb) (free right)
   goals met: 20 of 22
39. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 21 of 22
40. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 21 of 22
41. (pick ball10 room3 left)
   deleted: (at ball10 room3) (free left)
   added: (carry ball10 left)
   goals met: 21 of 22
42. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 21 of 22
43. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 22 of 22
